; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v4 - type_1 ?v8 - type_3)
 	      (pred_4 ?v7 - object ?v8 - type_3)
	      (pred_2 ?v4 - type_1 ?v5 - type_2)
	      (pred_1 ?v4 - type_1 ?v7 - object ?v5 - type_2))

   (:action op_3
       :parameters  (?v4 - type_1 ?v1 ?v2 - type_3)
       :precondition (and  (pred_3 ?v4 ?v1))
       :effect (and  (pred_3 ?v4 ?v2)
		     (not (pred_3 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_1 ?v3 - object ?v6 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v6) (pred_3 ?v4 ?v6) (pred_2 ?v4 ?v5))
       :effect (and (pred_1 ?v4 ?v3 ?v5)
		    (not (pred_4 ?v3 ?v6)) 
		    (not (pred_2 ?v4 ?v5))))

   (:action op_2
       :parameters (?v4 - type_1 ?v3 - object ?v6 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v3 ?v5) (pred_3 ?v4 ?v6))
       :effect (and (pred_4 ?v3 ?v6)
		    (pred_2 ?v4 ?v5)
		    (not (pred_1 ?v4 ?v3 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_08 obj_13 - type_1
obj_09 obj_03 obj_06 obj_12 - type_2
obj_11 obj_10 obj_07 obj_02 - type_3
obj_04 obj_05 obj_01 - object)
(:init
(pred_3 obj_08 obj_11)
(pred_2 obj_08 obj_09)
(pred_2 obj_08 obj_03)
(pred_3 obj_13 obj_10)
(pred_2 obj_13 obj_06)
(pred_2 obj_13 obj_12)
(pred_4 obj_04 obj_11)
(pred_4 obj_05 obj_11)
(pred_4 obj_01 obj_02)
)
(:goal
(and
(pred_4 obj_04 obj_07)
(pred_4 obj_05 obj_10)
(pred_4 obj_01 obj_11)
)
)

(:constraints
  (always (not (pred_3 obj_08 obj_07)))
)
)

; plan
1. (op_1 obj_08 obj_04 obj_11 obj_03)
   deleted: (pred_4 obj_04 obj_11) (pred_2 obj_08 obj_03)
   added: (pred_1 obj_08 obj_04 obj_03)
   goals met: 0 of 3
2. (op_1 obj_08 obj_05 obj_11 obj_09)
   deleted: (pred_4 obj_05 obj_11) (pred_2 obj_08 obj_09)
   added: (pred_1 obj_08 obj_05 obj_09)
   goals met: 0 of 3
3. (op_3 obj_13 obj_10 obj_02)
   deleted: (pred_3 obj_13 obj_10)
   added: (pred_3 obj_13 obj_02)
   goals met: 0 of 3
4. (op_3 obj_08 obj_11 obj_10)
   deleted: (pred_3 obj_08 obj_11)
   added: (pred_3 obj_08 obj_10)
   goals met: 0 of 3
5. (op_1 obj_13 obj_01 obj_02 obj_12)
   deleted: (pred_4 obj_01 obj_02) (pred_2 obj_13 obj_12)
   added: (pred_1 obj_13 obj_01 obj_12)
   goals met: 0 of 3
6. (op_3 obj_13 obj_02 obj_11)
   deleted: (pred_3 obj_13 obj_02)
   added: (pred_3 obj_13 obj_11)
   goals met: 0 of 3
7. (op_2 obj_08 obj_05 obj_10 obj_09)
   deleted: (pred_1 obj_08 obj_05 obj_09)
   added: (pred_4 obj_05 obj_10) (pred_2 obj_08 obj_09)
   goals met: 1 of 3
8. (op_2 obj_08 obj_04 obj_10 obj_03)
   deleted: (pred_1 obj_08 obj_04 obj_03)
   added: (pred_4 obj_04 obj_10) (pred_2 obj_08 obj_03)
   goals met: 1 of 3
9. (op_2 obj_13 obj_01 obj_11 obj_12)
   deleted: (pred_1 obj_13 obj_01 obj_12)
   added: (pred_4 obj_01 obj_11) (pred_2 obj_13 obj_12)
   goals met: 2 of 3
10. (op_3 obj_13 obj_11 obj_10)
   deleted: (pred_3 obj_13 obj_11)
   added: (pred_3 obj_13 obj_10)
   goals met: 2 of 3
11. (op_1 obj_13 obj_04 obj_10 obj_12)
   deleted: (pred_4 obj_04 obj_10) (pred_2 obj_13 obj_12)
   added: (pred_1 obj_13 obj_04 obj_12)
   goals met: 2 of 3
12. (op_3 obj_13 obj_10 obj_07)
   deleted: (pred_3 obj_13 obj_10)
   added: (pred_3 obj_13 obj_07)
   goals met: 2 of 3
13. (op_2 obj_13 obj_04 obj_07 obj_12)
   deleted: (pred_1 obj_13 obj_04 obj_12)
   added: (pred_4 obj_04 obj_07) (pred_2 obj_13 obj_12)
   goals met: 3 of 3
